app/controllers/admin/users_controller.rb

INSERT INTO "users" ("name", "university", "interest", "password_digest", "created_at", "updated_at", "email") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @user = User.new(user_params)

    if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "users" SET "interest" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["interest", "aaa"], ["updated_at", "2019-07-10 23:26:52.943779"], ["id", 3]]
---
  def update
    @user = User.find(params[:id])
    if @user.update(user_params)