app/controllers/articles_controller.rb

INSERT INTO "articles" ("name", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "underx"], ["description", "楽しかったです！"], ["created_at", "2019-07-07 12:37:25.423568"], ["updated_at", "2019-07-07 12:37:25.423568"]]
---
  def create
    article = Article.new(article_params)
    article.save!

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
DELETE FROM "articles" WHERE "articles"."id" = $1  [["id", 7]]
---
  def destroy
    article = Article.find(params[:id])
    article.destroy

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "articles" SET "description" = $1, "updated_at" = $2 WHERE "articles"."id" = $3  [["description", "日本最大の学園祭と言っても過言ではない。\r\nこの祭はやばい\r\nすごい\r\n行くべき！"], ["updated_at", "2019-07-10 23:26:22.302882"], ["id", 5]]
---
  def update
    @article = Article.find(params[:id])
    if @article.update(article_params)